cf/InformationRegisters/КомментарииЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>КомментарииЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Documents/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>Задача</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗатраченноеВремя</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЧаса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Рубли</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Рубли</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Час</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Час</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПоФакту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonForms/РабочийСтол/Ext/Form/Module.bsl
&НаКлиенте
Перем НеВыполнятьОбработкуАктивацииСтроки;

&НаСервере
Функция ПолучитьHTML(Параметры)
	
	
	
КонецФункции

Функция ПолучитьСтруктуруЗадачи()
	
	Возврат Новый Структура("Проект, Статус, Наименование, СтоимостьЧаса, Факт, Сумма, План, Ответственный, Описание, Комментарий",
							Проект, Статус, Наименование, СтоимостьЧаса, Факт, Сумма, План, текПользователь, Описание, Комментарий);
КонецФункции

&НаСервере
Функция СохранитьЗадачу()
	
	Если ПустаяСтрока(Наименование) Тогда	// пустую задачу не сохраняем и игнорруем
		Возврат истина; КонецЕсли;
	
	Если текЗадача.Пустая() Тогда	
		ДокЗад = Документы.Задача.СоздатьДокумент();
		ДокЗад.ДатаСоздания = ТекущаяДата();
		ДокЗад.Автор 		= текПользователь;
	Иначе 
		ДокЗад = текЗадача.ПолучитьОбъект(); КонецЕсли;
	
	Структура = ПолучитьСтруктуруЗадачи();
	Структура.Вставить("Дата", ТекущаяДата());
	ДокЗад.Заполнить(Новый Структура("Шапка", Структура));
	
	НачатьТранзакцию();
	
	Если Не ОбщиеФункции.ЗаписатьИзмененияОбъекта(ДокЗад, Структура, РежимЗаписиДокумента.Проведение, "Дата, Комментарий") Тогда
		ОтменитьТранзакцию();
		Возврат Ложь; КонецЕсли;
	
	Если не ПустаяСтрока(Комментарий) Тогда
		Запись = РегистрыСведений.КомментарииЗадач.СоздатьМенеджерЗаписи();
		Запись.Период 		= Структура.Дата;
		Запись.Задача 		= ДокЗад.Ссылка;
		Запись.Комментарий 	= Комментарий;
		Запись.Автор 		= текПользователь; 
		
		Если Не ОбщиеФункции.ЗаписатьИСообщитьЕслиОшибка(Запись) Тогда
			ОтменитьТранзакцию();
			Возврат Ложь; КонецЕсли; КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	текЗадача = ДокЗад.Ссылка;
	
	Возврат Истина;
	
КонецФункции
&НаСервере
Процедура ОбновитьПрошлыеКомментарии()
	
	Запрос = Новый Запрос("ВЫБРАТЬ Комментарий, Период ИЗ РегистрСведений.КомментарииЗадач ГДЕ Задача = &Задача УПОРЯДОЧИТЬ ПО период Убыв");
	Запрос.УстановитьПараметр("Задача", текЗадача);
	
	масскомментов = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		масскомментов.Добавить(Формат(Выборка.Период, "ДЛФ=DDT"));
		масскомментов.Добавить(Выборка.Комментарий); КонецЦикла;
	
	ПредыдущиеКомментарии = СтрСоединить(масскомментов, Символы.ПС);
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьЗадачу()
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, текЗадача);
	ОбновитьПрошлыеКомментарии();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ПустаяДата", '00010101');
	
	текПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТекстHTML = ПолучитьHTML(Новый Структура);
	УстановитьФильтПоПроекту();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНоваяЗадачаНажатие(Элемент)
	
	стПроект 		= Проект;
	стПользователь 	= текПользователь;
	
	Если остановитьТаймер() Тогда
		Если СохранитьЗадачу() Тогда
			Элементы.Задачи.Обновить(); КонецЕсли; КонецЕсли;
	
	текЗадача = ПредопределенноеЗначение("Документ.Задача.ПустаяСсылка");
	ОбновитьЗадачу(); 
		
	Проект 			= стПроект;
	текПользователь = стПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура loopTimer() Экспорт 
	
	Прошло = ТекущаяДата() - ДатаНачалаОтчетаТаймера;
	ДатаНачалаОтчетаТаймера = ТекущаяДата();
	
	Факт = Факт + Прошло;
	
	ТаймерСчетчик = '00010101' + Факт;
	
КонецПроцедуры
&НаКлиенте
Функция ОстановитьТаймер()
	
	// Возвращает истина если таймер был запущен и остановлен и ложь если не был запущен
	
	Если ДатаНачалаОтчетаТаймера = '00010101' Тогда
		Возврат Ложь;
	Иначе
	
		ДатаНачалаОтчетаТаймера = '00010101';
		ОтключитьОбработчикОжидания("loopTimer");
			
		Элементы.ТаймерСчетчик.Видимость = Ложь;
		Элементы.Таймер.ЦветФона = новый Цвет;
		Элементы.Таймер.Заголовок = "Таймер"; 
		
		Возврат Истина; КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура ЗапуститьТаймер()
	
	ДатаНачалаОтчетаТаймера = ТекущаяДата();
	ПодключитьОбработчикОжидания("loopTimer", 1, Ложь);
		
	Элементы.ТаймерСчетчик.Видимость = Истина;
	Элементы.Таймер.ЦветФона = новый Цвет(255, 255, 153);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗадачиПриАктивизацииСтроки(Элемент)
	
	Если НеВыполнятьОбработкуАктивацииСтроки = Истина Тогда
		НеВыполнятьОбработкуАктивацииСтроки = Ложь;
		Возврат КонецЕсли;
	
	ТекСтрока = Элементы.Задачи.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено И ТекСтрока <> текЗадача Тогда
		
		Если ОстановитьТаймер() Тогда
			Если СохранитьЗадачу() Тогда
				Элементы.Задачи.Обновить();КонецЕсли; КонецЕсли;
		
		текЗадача = ТекСтрока;
		ОбновитьЗадачу(); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Таймер(Команда)
	
	Если ДатаНачалаОтчетаТаймера = '00010101' Тогда
		НеВыполнятьОбработкуАктивацииСтроки = Истина;
	    ЗапуститьТаймер();
		НеВыполнятьОбработкуАктивацииСтроки = Истина;
		Элементы.Задачи.ТекущаяСтрока = текЗадача;
	Иначе	
		остановитьТаймер();
		Если СохранитьЗадачу() Тогда
			Элементы.Задачи.ТекущаяСтрока = текЗадача;
			Элементы.Задачи.Обновить(); КонецЕсли; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаЗадачи(Элемент)
	
	Сумма = СтоимостьЧаса * ?(РасчетПоФакту, Факт / 3600, План);
	
	Если СохранитьЗадачу() Тогда
		Элементы.Задачи.Обновить(); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Если СохранитьЗадачу() Тогда
		Комментарий = "";
		ОбновитьПрошлыеКомментарии();
		Элементы.Задачи.Обновить(); КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьФильтПоПроекту()
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбора(СписокЗадач.Отбор, "Проект", Проект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	УстановитьФильтПоПроекту()
	
КонецПроцедуры
